rob-zeno/hal_nxp/dts/nxp/s32/S32K312-172MQFP-pinctrl.h
/* CAN1 */
#define PTA11_CAN1_TX                   NXP_SIUL2_PINMUX(0, 0, 11, 1, 0, 0)
#define PTA12_CAN1_RX                   NXP_SIUL2_PINMUX(0, 0, 12, 0, 1, 2)
#define PTB22_CAN1_TX                   NXP_SIUL2_PINMUX(0, 0, 54, 1, 0, 0)
#define PTB23_CAN1_RX                   NXP_SIUL2_PINMUX(0, 0, 55, 0, 1, 4)
#define PTC8_CAN1_TX                    NXP_SIUL2_PINMUX(0, 0, 72, 3, 0, 0)
#define PTC9_CAN1_RX                    NXP_SIUL2_PINMUX(0, 0, 73, 0, 1, 1)

/* CMP1 */
#define PTA12_CMP1_OUT                  NXP_SIUL2_PINMUX(0, 0, 12, 7, 0, 0)
#define PTE15_CMP1_RRT                  NXP_SIUL2_PINMUX(0, 0, 143, 5, 0, 0)

#if 0
/* LPUART11 */
#define PTA12_LPUART11_RX               NXP_SIUL2_PINMUX(0, 0, 12, 0, 198, 2)
#define PTA13_LPUART11_TX_O             NXP_SIUL2_PINMUX(0, 0, 13, 7, 0, 0)
#define PTA13_LPUART11_TX_I             NXP_SIUL2_PINMUX(0, 0, 13, 0, 374, 1)
#define PTC10_LPUART11_TX_O             NXP_SIUL2_PINMUX(0, 0, 74, 2, 0, 0)
#define PTC10_LPUART11_TX_I             NXP_SIUL2_PINMUX(0, 0, 74, 0, 374, 2)
#define PTC11_LPUART11_RX               NXP_SIUL2_PINMUX(0, 0, 75, 0, 198, 1)
#endif

/* LPUART6 */
#define PTA15_LPUART6_RX                NXP_SIUL2_PINMUX(0, 0, 15, 0, 193, 2)
#define PTA16_LPUART6_TX_O              NXP_SIUL2_PINMUX(0, 0, 16, 5, 0, 0)
#define PTA16_LPUART6_TX_I              NXP_SIUL2_PINMUX(0, 0, 16, 0, 369, 1)
#define PTB29_LPUART6_TX_O              NXP_SIUL2_PINMUX(0, 0, 61, 1, 0, 0)
#define PTB29_LPUART6_TX_I              NXP_SIUL2_PINMUX(0, 0, 61, 0, 369, 3)
#define PTC18_LPUART6_RX                NXP_SIUL2_PINMUX(0, 0, 82, 0, 193, 4)
#define PTD8_LPUART6_RX                 NXP_SIUL2_PINMUX(0, 0, 104, 0, 193, 1)
#define PTD9_LPUART6_TX_O               NXP_SIUL2_PINMUX(0, 0, 105, 4, 0, 0)
#define PTD9_LPUART6_TX_I               NXP_SIUL2_PINMUX(0, 0, 105, 0, 369, 2)

/* LPUART4 */
#define PTA17_LPUART4_TX_O              NXP_SIUL2_PINMUX(0, 0, 17, 4, 0, 0)
#define PTA17_LPUART4_TX_I              NXP_SIUL2_PINMUX(0, 0, 17, 0, 367, 1)
#define PTB16_LPUART4_TX_O              NXP_SIUL2_PINMUX(0, 0, 48, 4, 0, 0)
#define PTB16_LPUART4_TX_I              NXP_SIUL2_PINMUX(0, 0, 48, 0, 367, 2)
#define PTB17_LPUART4_RX                NXP_SIUL2_PINMUX(0, 0, 49, 0, 191, 3)
#define PTE7_LPUART4_RX                 NXP_SIUL2_PINMUX(0, 0, 135, 0, 191, 4)
#define PTE10_LPUART4_RX                NXP_SIUL2_PINMUX(0, 0, 138, 0, 191, 2)
#define PTE11_LPUART4_TX_O              NXP_SIUL2_PINMUX(0, 0, 139, 1, 0, 0)
#define PTE11_LPUART4_TX_I              NXP_SIUL2_PINMUX(0, 0, 139, 0, 367, 3)

/* EMAC */
#define PTA27_EMAC_PPS1_O               NXP_SIUL2_PINMUX(0, 0, 27, 3, 0, 0)
#define PTA27_EMAC_PPS1_I               NXP_SIUL2_PINMUX(0, 0, 27, 0, 145, 3)
#define PTA29_EMAC_PPS2_O               NXP_SIUL2_PINMUX(0, 0, 29, 3, 0, 0)
#define PTA29_EMAC_PPS2_I               NXP_SIUL2_PINMUX(0, 0, 29, 0, 146, 3)
#define PTB4_EMAC_MII_RMII_TXD1         NXP_SIUL2_PINMUX(0, 0, 36, 1, 0, 0)
#define PTB4_EMAC_MII_RMII_MDIO_O       NXP_SIUL2_PINMUX(0, 0, 36, 5, 0, 0)
#define PTB4_EMAC_MII_RMII_MDIO_I       NXP_SIUL2_PINMUX(0, 0, 36, 0, 291, 1)
#define PTB5_EMAC_MII_RMII_TXD0         NXP_SIUL2_PINMUX(0, 0, 37, 1, 0, 0)
#define PTB5_EMAC_MII_RMII_MDC          NXP_SIUL2_PINMUX(0, 0, 37, 7, 0, 0)
#define PTB22_EMAC_MII_CRS              NXP_SIUL2_PINMUX(0, 0, 54, 0, 290, 1)
#define PTB23_EMAC_MII_COL              NXP_SIUL2_PINMUX(0, 0, 55, 0, 289, 1)
#define PTB28_EMAC_PPS3_O               NXP_SIUL2_PINMUX(0, 0, 60, 7, 0, 0)
#define PTB28_EMAC_PPS3_I               NXP_SIUL2_PINMUX(0, 0, 60, 0, 147, 2)
#define PTC0_EMAC_MII_RMII_RXD0         NXP_SIUL2_PINMUX(0, 0, 64, 0, 294, 2)
#define PTC0_EMAC_MII_RMII_RXD1         NXP_SIUL2_PINMUX(0, 0, 64, 0, 295, 1)
#define PTC0_EMAC_MII_RMII_TX_CLK       NXP_SIUL2_PINMUX(0, 0, 64, 0, 296, 4)
#define PTC1_EMAC_MII_RMII_RXD0         NXP_SIUL2_PINMUX(0, 0, 65, 0, 294, 1)
#define PTC1_EMAC_MII_RMII_RXD1         NXP_SIUL2_PINMUX(0, 0, 65, 0, 295, 2)
#define PTC1_EMAC_MII_RX_CLK            NXP_SIUL2_PINMUX(0, 0, 65, 0, 300, 3)
#define PTC2_EMAC_MII_RMII_TXD1         NXP_SIUL2_PINMUX(0, 0, 66, 1, 0, 0)
#define PTC2_EMAC_MII_RMII_TXD0         NXP_SIUL2_PINMUX(0, 0, 66, 5, 0, 0)
#define PTC14_EMAC_MII_COL              NXP_SIUL2_PINMUX(0, 0, 78, 0, 289, 2)
#define PTC14_EMAC_MII_RMII_RX_ER       NXP_SIUL2_PINMUX(0, 0, 78, 0, 293, 2)
#define PTC14_EMAC_MII_RXD3             NXP_SIUL2_PINMUX(0, 0, 78, 0, 302, 2)
#define PTC15_EMAC_MII_CRS              NXP_SIUL2_PINMUX(0, 0, 79, 0, 290, 2)
#define PTC15_EMAC_MII_RMII_RX_DV       NXP_SIUL2_PINMUX(0, 0, 79, 0, 292, 2)
#define PTC15_EMAC_MII_RXD2             NXP_SIUL2_PINMUX(0, 0, 79, 0, 301, 2)
#define PTC16_EMAC_MII_RMII_RX_ER       NXP_SIUL2_PINMUX(0, 0, 80, 0, 293, 1)
#define PTC17_EMAC_MII_RMII_RX_DV       NXP_SIUL2_PINMUX(0, 0, 81, 0, 292, 1)
#define PTD5_EMAC_MII_TXD2              NXP_SIUL2_PINMUX(0, 0, 101, 1, 0, 0)
#define PTD5_EMAC_MII_TXD3              NXP_SIUL2_PINMUX(0, 0, 101, 5, 0, 0)
#define PTD5_EMAC_MII_RX_CLK            NXP_SIUL2_PINMUX(0, 0, 101, 0, 300, 2)
#define PTD6_EMAC_MII_TXD3              NXP_SIUL2_PINMUX(0, 0, 102, 1, 0, 0)
#define PTD6_EMAC_MII_TXD2              NXP_SIUL2_PINMUX(0, 0, 102, 5, 0, 0)
#define PTD6_EMAC_MII_RMII_TX_CLK       NXP_SIUL2_PINMUX(0, 0, 102, 0, 296, 2)
#define PTD7_EMAC_MII_RMII_TXD0         NXP_SIUL2_PINMUX(0, 0, 103, 1, 0, 0)
#define PTD7_EMAC_MII_RMII_TXD1         NXP_SIUL2_PINMUX(0, 0, 103, 5, 0, 0)
#define PTD8_EMAC_MII_RMII_RXD1         NXP_SIUL2_PINMUX(0, 0, 104, 0, 295, 3)
#define PTD8_EMAC_MII_RXD3              NXP_SIUL2_PINMUX(0, 0, 104, 0, 302, 1)
#define PTD9_EMAC_MII_RMII_RXD0         NXP_SIUL2_PINMUX(0, 0, 105, 0, 294, 3)
#define PTD9_EMAC_MII_RXD2              NXP_SIUL2_PINMUX(0, 0, 105, 0, 301, 1)
#define PTD10_EMAC_MII_TXD3             NXP_SIUL2_PINMUX(0, 0, 106, 1, 0, 0)
#define PTD10_EMAC_MII_RX_CLK           NXP_SIUL2_PINMUX(0, 0, 106, 0, 300, 1)
#define PTD11_EMAC_MII_TXD2             NXP_SIUL2_PINMUX(0, 0, 107, 1, 0, 0)
#define PTD11_EMAC_MII_RMII_TX_EN       NXP_SIUL2_PINMUX(0, 0, 107, 3, 0, 0)
#define PTD11_EMAC_MII_RMII_TX_CLK      NXP_SIUL2_PINMUX(0, 0, 107, 0, 296, 1)
#define PTD12_EMAC_MII_RMII_TX_EN       NXP_SIUL2_PINMUX(0, 0, 108, 5, 0, 0)
#define PTD12_EMAC_MII_RMII_TX_CLK      NXP_SIUL2_PINMUX(0, 0, 108, 0, 296, 3)
#define PTD13_EMAC_PPS1_O               NXP_SIUL2_PINMUX(0, 0, 109, 5, 0, 0)
#define PTD13_EMAC_PPS1_I               NXP_SIUL2_PINMUX(0, 0, 109, 0, 145, 2)
#define PTD14_EMAC_PPS0_O               NXP_SIUL2_PINMUX(0, 0, 110, 5, 0, 0)
#define PTD14_EMAC_PPS0_I               NXP_SIUL2_PINMUX(0, 0, 110, 0, 144, 2)
#define PTD15_EMAC_PPS2_O               NXP_SIUL2_PINMUX(0, 0, 111, 5, 0, 0)
#define PTD15_EMAC_PPS2_I               NXP_SIUL2_PINMUX(0, 0, 111, 0, 146, 2)
#define PTD16_EMAC_MII_RMII_MDIO_O      NXP_SIUL2_PINMUX(0, 0, 112, 3, 0, 0)
#define PTD16_EMAC_MII_RMII_MDIO_I      NXP_SIUL2_PINMUX(0, 0, 112, 0, 291, 2)
#define PTD17_EMAC_MII_RMII_MDC         NXP_SIUL2_PINMUX(0, 0, 113, 3, 0, 0)
#define PTD17_EMAC_PPS2_O               NXP_SIUL2_PINMUX(0, 0, 113, 7, 0, 0)
#define PTD17_EMAC_PPS2_I               NXP_SIUL2_PINMUX(0, 0, 113, 0, 146, 1)
#define PTE3_EMAC_PPS0_O                NXP_SIUL2_PINMUX(0, 0, 131, 6, 0, 0)
#define PTE3_EMAC_PPS0_I                NXP_SIUL2_PINMUX(0, 0, 131, 0, 144, 1)
#define PTE8_EMAC_MII_RMII_MDC          NXP_SIUL2_PINMUX(0, 0, 136, 5, 0, 0)
#define PTE9_EMAC_PPS3_O                NXP_SIUL2_PINMUX(0, 0, 137, 5, 0, 0)
#define PTE9_EMAC_MII_RMII_TX_EN        NXP_SIUL2_PINMUX(0, 0, 137, 6, 0, 0)
#define PTE9_EMAC_PPS3_I                NXP_SIUL2_PINMUX(0, 0, 137, 0, 147, 1)
#define PTE12_EMAC_PPS3_O               NXP_SIUL2_PINMUX(0, 0, 140, 5, 0, 0)
#define PTE12_EMAC_PPS3_I               NXP_SIUL2_PINMUX(0, 0, 140, 0, 147, 3)
#define PTE14_EMAC_PPS1_O               NXP_SIUL2_PINMUX(0, 0, 142, 7, 0, 0)
#define PTE14_EMAC_PPS1_I               NXP_SIUL2_PINMUX(0, 0, 142, 0, 145, 1)

/* LPI2C0 */
#define PTB0_LPI2C0_SDAS_O              NXP_SIUL2_PINMUX(0, 0, 32, 1, 0, 0)
#define PTB0_LPI2C0_SDAS_I              NXP_SIUL2_PINMUX(0, 0, 32, 0, 215, 1)
#define PTB1_LPI2C0_SCLS_O              NXP_SIUL2_PINMUX(0, 0, 33, 1, 0, 0)
#define PTB1_LPI2C0_SCLS_I              NXP_SIUL2_PINMUX(0, 0, 33, 0, 213, 1)
#define PTB11_LPI2C0_HREQ               NXP_SIUL2_PINMUX(0, 0, 43, 0, 211, 1)
#define PTC7_LPI2C0_HREQ                NXP_SIUL2_PINMUX(0, 0, 71, 0, 211, 2)
#define PTC8_LPI2C0_SCL_O               NXP_SIUL2_PINMUX(0, 0, 72, 1, 0, 0)
#define PTC8_LPI2C0_SCL_I               NXP_SIUL2_PINMUX(0, 0, 72, 0, 212, 1)
#define PTC9_LPI2C0_SDA_O               NXP_SIUL2_PINMUX(0, 0, 73, 1, 0, 0)
#define PTC9_LPI2C0_SDA_I               NXP_SIUL2_PINMUX(0, 0, 73, 0, 214, 1)
#define PTD13_LPI2C0_SDA_O              NXP_SIUL2_PINMUX(0, 0, 109, 4, 0, 0)
#define PTD13_LPI2C0_SDA_I              NXP_SIUL2_PINMUX(0, 0, 109, 0, 214, 2)
#define PTD14_LPI2C0_SCL_O              NXP_SIUL2_PINMUX(0, 0, 110, 4, 0, 0)
#define PTD14_LPI2C0_SCL_I              NXP_SIUL2_PINMUX(0, 0, 110, 0, 212, 2)

/* LCU1 */
#define PTB0_LCU1_OUT5                  NXP_SIUL2_PINMUX(0, 0, 32, 5, 0, 0)
#define PTB1_LCU1_OUT4                  NXP_SIUL2_PINMUX(0, 0, 33, 7, 0, 0)
#define PTB2_LCU1_OUT3                  NXP_SIUL2_PINMUX(0, 0, 34, 5, 0, 0)
#define PTB3_LCU1_OUT2                  NXP_SIUL2_PINMUX(0, 0, 35, 6, 0, 0)
#define PTB28_LCU1_OUT11                NXP_SIUL2_PINMUX(0, 0, 60, 6, 0, 0)
#define PTB29_LCU1_OUT10                NXP_SIUL2_PINMUX(0, 0, 61, 6, 0, 0)
#define PTC8_LCU1_OUT7                  NXP_SIUL2_PINMUX(0, 0, 72, 5, 0, 0)
#define PTC9_LCU1_OUT6                  NXP_SIUL2_PINMUX(0, 0, 73, 5, 0, 0)
#define PTC10_LCU1_OUT11                NXP_SIUL2_PINMUX(0, 0, 74, 6, 0, 0)
#define PTC11_LCU1_OUT10                NXP_SIUL2_PINMUX(0, 0, 75, 7, 0, 0)
#define PTC12_LCU1_OUT9                 NXP_SIUL2_PINMUX(0, 0, 76, 6, 0, 0)
#define PTC13_LCU1_OUT8                 NXP_SIUL2_PINMUX(0, 0, 77, 6, 0, 0)
#define PTC14_LCU1_OUT1                 NXP_SIUL2_PINMUX(0, 0, 78, 6, 0, 0)
#define PTC15_LCU1_OUT0                 NXP_SIUL2_PINMUX(0, 0, 79, 6, 0, 0)
#define PTC18_LCU1_OUT7                 NXP_SIUL2_PINMUX(0, 0, 82, 6, 0, 0)
#define PTC19_LCU1_OUT6                 NXP_SIUL2_PINMUX(0, 0, 83, 6, 0, 0)
#define PTC20_LCU1_OUT5                 NXP_SIUL2_PINMUX(0, 0, 84, 6, 0, 0)
#define PTC21_LCU1_OUT4                 NXP_SIUL2_PINMUX(0, 0, 85, 6, 0, 0)
#define PTC23_LCU1_OUT0                 NXP_SIUL2_PINMUX(0, 0, 87, 6, 0, 0)
#define PTC24_LCU1_OUT1                 NXP_SIUL2_PINMUX(0, 0, 88, 6, 0, 0)
#define PTC25_LCU1_OUT2                 NXP_SIUL2_PINMUX(0, 0, 89, 6, 0, 0)
#define PTC26_LCU1_OUT9                 NXP_SIUL2_PINMUX(0, 0, 90, 6, 0, 0)
#define PTC27_LCU1_OUT3                 NXP_SIUL2_PINMUX(0, 0, 91, 6, 0, 0)
#define PTC28_LCU1_OUT8                 NXP_SIUL2_PINMUX(0, 0, 92, 6, 0, 0)

/* HSE */
#define PTB0_HSE_TAMPER_LOOP_OUT0       NXP_SIUL2_PINMUX(0, 0, 32, 7, 0, 0)
#define PTB1_HSE_TAMPER_EXTIN0          NXP_SIUL2_PINMUX(0, 0, 33, 0, 343, 1)
#define PTD23_HSE_TAMPER_LOOP_OUT0      NXP_SIUL2_PINMUX(0, 0, 119, 5, 0, 0)
#define PTD24_HSE_TAMPER_EXTIN0         NXP_SIUL2_PINMUX(0, 0, 120, 0, 343, 2)

/* ADC1 */
#define PTB2_ADC1_MA0                   NXP_SIUL2_PINMUX(0, 0, 34, 1, 0, 0)
#define PTB23_ADC1_MA0                  NXP_SIUL2_PINMUX(0, 0, 55, 1, 0, 0)
#define PTB24_ADC1_MA1                  NXP_SIUL2_PINMUX(0, 0, 56, 1, 0, 0)
#define PTB28_ADC1_MA2                  NXP_SIUL2_PINMUX(0, 0, 60, 1, 0, 0)
#define PTC12_ADC1_MA2                  NXP_SIUL2_PINMUX(0, 0, 76, 1, 0, 0)
#define PTC13_ADC1_MA1                  NXP_SIUL2_PINMUX(0, 0, 77, 4, 0, 0)
#define PTC20_ADC1_MA2                  NXP_SIUL2_PINMUX(0, 0, 84, 5, 0, 0)
#define PTC21_ADC1_MA1                  NXP_SIUL2_PINMUX(0, 0, 85, 5, 0, 0)
#define PTC27_ADC1_MA0                  NXP_SIUL2_PINMUX(0, 0, 91, 5, 0, 0)

/* SAI0 */
#define PTB2_SAI0_D0_O                  NXP_SIUL2_PINMUX(0, 0, 34, 6, 0, 0)
#define PTB2_SAI0_D0_I                  NXP_SIUL2_PINMUX(0, 0, 34, 0, 316, 1)
#define PTB3_SAI0_MCLK                  NXP_SIUL2_PINMUX(0, 0, 35, 0, 320, 1)
#define PTB29_SAI0_D1_O                 NXP_SIUL2_PINMUX(0, 0, 61, 7, 0, 0)
#define PTB29_SAI0_D1_I                 NXP_SIUL2_PINMUX(0, 0, 61, 0, 317, 1)
#define PTC12_SAI0_BCLK_O               NXP_SIUL2_PINMUX(0, 0, 76, 7, 0, 0)
#define PTC12_SAI0_BCLK_I               NXP_SIUL2_PINMUX(0, 0, 76, 0, 315, 1)
#define PTC13_SAI0_SYNC_O               NXP_SIUL2_PINMUX(0, 0, 77, 7, 0, 0)
#define PTC13_SAI0_SYNC_I               NXP_SIUL2_PINMUX(0, 0, 77, 0, 321, 1)
#define PTC18_SAI0_D2_O                 NXP_SIUL2_PINMUX(0, 0, 82, 7, 0, 0)
#define PTC18_SAI0_D2_I                 NXP_SIUL2_PINMUX(0, 0, 82, 0, 318, 1)
#define PTC19_SAI0_D3_O                 NXP_SIUL2_PINMUX(0, 0, 83, 7, 0, 0)
#define PTC19_SAI0_D3_I                 NXP_SIUL2_PINMUX(0, 0, 83, 0, 319, 1)

/* CAN4 */
#define PTB2_CAN4_RX                    NXP_SIUL2_PINMUX(0, 0, 34, 0, 4, 2)
#define PTB3_CAN4_TX                    NXP_SIUL2_PINMUX(0, 0, 35, 5, 0, 0)
#define PTC30_CAN4_TX                   NXP_SIUL2_PINMUX(0, 0, 94, 1, 0, 0)
#define PTC31_CAN4_RX                   NXP_SIUL2_PINMUX(0, 0, 95, 0, 4, 3)
#define PTE3_CAN4_TX                    NXP_SIUL2_PINMUX(0, 0, 131, 1, 0, 0)
#define PTE14_CAN4_RX                   NXP_SIUL2_PINMUX(0, 0, 142, 0, 4, 1)

