rob-zeno/hal_nxp/dts/nxp/s32/S32K312-172MQFP-pinctrl.h
#if 0
/* LPUART9 */
#define PTB2_LPUART9_RX                 NXP_SIUL2_PINMUX(0, 0, 34, 0, 196, 2)
#define PTB3_LPUART9_TX_O               NXP_SIUL2_PINMUX(0, 0, 35, 1, 0, 0)
#define PTB3_LPUART9_TX_I               NXP_SIUL2_PINMUX(0, 0, 35, 0, 372, 1)
#define PTB9_LPUART9_RX                 NXP_SIUL2_PINMUX(0, 0, 41, 0, 196, 1)
#define PTB10_LPUART9_TX_O              NXP_SIUL2_PINMUX(0, 0, 42, 5, 0, 0)
#define PTB10_LPUART9_TX_I              NXP_SIUL2_PINMUX(0, 0, 42, 0, 372, 2)
#endif

/* ADC0 */
#define PTB3_ADC0_MA0                   NXP_SIUL2_PINMUX(0, 0, 35, 4, 0, 0)
#define PTC6_ADC0_MA2                   NXP_SIUL2_PINMUX(0, 0, 70, 7, 0, 0)
#define PTC14_ADC0_MA1                  NXP_SIUL2_PINMUX(0, 0, 78, 4, 0, 0)
#define PTC15_ADC0_MA2                  NXP_SIUL2_PINMUX(0, 0, 79, 4, 0, 0)
#define PTE2_ADC0_MA0                   NXP_SIUL2_PINMUX(0, 0, 130, 7, 0, 0)
#define PTE6_ADC0_MA1                   NXP_SIUL2_PINMUX(0, 0, 134, 7, 0, 0)

#if 0
/* LPUART8 */
#define PTB12_LPUART8_RX                NXP_SIUL2_PINMUX(0, 0, 44, 0, 195, 1)
#define PTB13_LPUART8_TX_O              NXP_SIUL2_PINMUX(0, 0, 45, 6, 0, 0)
#define PTB13_LPUART8_TX_I              NXP_SIUL2_PINMUX(0, 0, 45, 0, 371, 1)
#define PTD15_LPUART8_RX                NXP_SIUL2_PINMUX(0, 0, 111, 0, 195, 2)
#define PTD16_LPUART8_TX_O              NXP_SIUL2_PINMUX(0, 0, 112, 7, 0, 0)
#define PTD16_LPUART8_TX_I              NXP_SIUL2_PINMUX(0, 0, 112, 0, 371, 2)
#endif

/* LPUART7 */
#define PTB14_LPUART7_RX                NXP_SIUL2_PINMUX(0, 0, 46, 0, 194, 1)
#define PTB15_LPUART7_TX_O              NXP_SIUL2_PINMUX(0, 0, 47, 6, 0, 0)
#define PTB15_LPUART7_TX_I              NXP_SIUL2_PINMUX(0, 0, 47, 0, 370, 1)
#define PTC19_LPUART7_TX_O              NXP_SIUL2_PINMUX(0, 0, 83, 1, 0, 0)
#define PTC19_LPUART7_TX_I              NXP_SIUL2_PINMUX(0, 0, 83, 0, 370, 2)
#define PTC20_LPUART7_RX                NXP_SIUL2_PINMUX(0, 0, 84, 0, 194, 4)
#define PTE0_LPUART7_RX                 NXP_SIUL2_PINMUX(0, 0, 128, 0, 194, 2)
#define PTE1_LPUART7_TX_O               NXP_SIUL2_PINMUX(0, 0, 129, 6, 0, 0)
#define PTE1_LPUART7_TX_I               NXP_SIUL2_PINMUX(0, 0, 129, 0, 370, 3)

#if 0
/* LPUART13 */
#define PTB18_LPUART13_TX_O             NXP_SIUL2_PINMUX(0, 0, 50, 1, 0, 0)
#define PTB18_LPUART13_TX_I             NXP_SIUL2_PINMUX(0, 0, 50, 0, 376, 1)
#define PTB19_LPUART13_RX               NXP_SIUL2_PINMUX(0, 0, 51, 0, 200, 1)
#define PTC26_LPUART13_TX_O             NXP_SIUL2_PINMUX(0, 0, 90, 1, 0, 0)
#define PTC26_LPUART13_TX_I             NXP_SIUL2_PINMUX(0, 0, 90, 0, 376, 2)
#define PTC27_LPUART13_RX               NXP_SIUL2_PINMUX(0, 0, 91, 0, 200, 2)

/* LPUART14 */
#define PTB20_LPUART14_TX_O             NXP_SIUL2_PINMUX(0, 0, 52, 1, 0, 0)
#define PTB20_LPUART14_TX_I             NXP_SIUL2_PINMUX(0, 0, 52, 0, 377, 1)
#define PTB21_LPUART14_RX               NXP_SIUL2_PINMUX(0, 0, 53, 0, 201, 1)
#define PTD26_LPUART14_TX_O             NXP_SIUL2_PINMUX(0, 0, 122, 1, 0, 0)
#define PTD26_LPUART14_TX_I             NXP_SIUL2_PINMUX(0, 0, 122, 0, 377, 2)
#define PTD27_LPUART14_RX               NXP_SIUL2_PINMUX(0, 0, 123, 0, 201, 2)

/* LPUART15 */
#define PTB25_LPUART15_TX_O             NXP_SIUL2_PINMUX(0, 0, 57, 1, 0, 0)
#define PTB25_LPUART15_TX_I             NXP_SIUL2_PINMUX(0, 0, 57, 0, 378, 1)
#define PTB26_LPUART15_RX               NXP_SIUL2_PINMUX(0, 0, 58, 0, 202, 1)
#define PTD28_LPUART15_TX_O             NXP_SIUL2_PINMUX(0, 0, 124, 1, 0, 0)
#define PTD28_LPUART15_TX_I             NXP_SIUL2_PINMUX(0, 0, 124, 0, 378, 2)
#define PTD29_LPUART15_RX               NXP_SIUL2_PINMUX(0, 0, 125, 0, 202, 2)
#endif

/* LPUART5 */
#define PTB27_LPUART5_TX_O              NXP_SIUL2_PINMUX(0, 0, 59, 1, 0, 0)
#define PTB27_LPUART5_TX_I              NXP_SIUL2_PINMUX(0, 0, 59, 0, 368, 3)
#define PTB28_LPUART5_RX                NXP_SIUL2_PINMUX(0, 0, 60, 0, 192, 4)
#define PTD0_LPUART5_RX                 NXP_SIUL2_PINMUX(0, 0, 96, 0, 192, 2)
#define PTD1_LPUART5_TX_O               NXP_SIUL2_PINMUX(0, 0, 97, 1, 0, 0)
#define PTD1_LPUART5_TX_I               NXP_SIUL2_PINMUX(0, 0, 97, 0, 368, 1)
#define PTE3_LPUART5_RX                 NXP_SIUL2_PINMUX(0, 0, 131, 0, 192, 1)
#define PTE14_LPUART5_TX_O              NXP_SIUL2_PINMUX(0, 0, 142, 4, 0, 0)
#define PTE14_LPUART5_TX_I              NXP_SIUL2_PINMUX(0, 0, 142, 0, 368, 2)

/* CAN3 */
#define PTC0_CAN3_TX                    NXP_SIUL2_PINMUX(0, 0, 64, 1, 0, 0)
#define PTC1_CAN3_RX                    NXP_SIUL2_PINMUX(0, 0, 65, 0, 3, 2)
#define PTC28_CAN3_TX                   NXP_SIUL2_PINMUX(0, 0, 92, 1, 0, 0)
#define PTC29_CAN3_RX                   NXP_SIUL2_PINMUX(0, 0, 93, 0, 3, 3)
#define PTD15_CAN3_RX                   NXP_SIUL2_PINMUX(0, 0, 111, 0, 3, 1)
#define PTE9_CAN3_TX                    NXP_SIUL2_PINMUX(0, 0, 137, 4, 0, 0)

/* TRACE */
#define PTC2_TRACE_ETM_CLKOUT           NXP_SIUL2_PINMUX(0, 0, 66, 6, 0, 0)
#define PTD7_TRACE_ETM_D0               NXP_SIUL2_PINMUX(0, 0, 103, 6, 0, 0)
#define PTD10_TRACE_ETM_D3              NXP_SIUL2_PINMUX(0, 0, 106, 4, 0, 0)
#define PTD11_TRACE_ETM_D2              NXP_SIUL2_PINMUX(0, 0, 107, 4, 0, 0)
#define PTD12_TRACE_ETM_D1              NXP_SIUL2_PINMUX(0, 0, 108, 4, 0, 0)

/* QUADSPI */
#define PTC2_QUADSPI_IOFA3_O            NXP_SIUL2_PINMUX(0, 0, 66, 7, 0, 0)
#define PTC2_QUADSPI_IOFA3_I            NXP_SIUL2_PINMUX(0, 0, 66, 0, 308, 1)
#define PTC3_QUADSPI_PCSFA              NXP_SIUL2_PINMUX(0, 0, 67, 6, 0, 0)
#define PTD7_QUADSPI_IOFA1_O            NXP_SIUL2_PINMUX(0, 0, 103, 7, 0, 0)
#define PTD7_QUADSPI_IOFA1_I            NXP_SIUL2_PINMUX(0, 0, 103, 0, 306, 1)
#define PTD10_QUADSPI_SCKFA_O           NXP_SIUL2_PINMUX(0, 0, 106, 7, 0, 0)
#define PTD10_QUADSPI_SCKFA_I           NXP_SIUL2_PINMUX(0, 0, 106, 0, 309, 1)
#define PTD11_QUADSPI_IOFA0_O           NXP_SIUL2_PINMUX(0, 0, 107, 7, 0, 0)
#define PTD11_QUADSPI_IOFA0_I           NXP_SIUL2_PINMUX(0, 0, 107, 0, 305, 1)
#define PTD12_QUADSPI_IOFA2_O           NXP_SIUL2_PINMUX(0, 0, 108, 7, 0, 0)
#define PTD12_QUADSPI_IOFA2_I           NXP_SIUL2_PINMUX(0, 0, 108, 0, 307, 1)

